archive/festivalsreview.old/app/controllers/festivals_controller.rb

  def index
    @festivals = Festival.all
---
SELECT * FROM "festivals"

  def show
    @festival = Festival.find(params[:id])
    @venues = Venue.all
---
SELECT * FROM "festivals" WHERE ("festivals"."id" = 1)
SELECT * FROM "venues"

  def edit
    @festival = Festival.find(params[:id])
---
SELECT * FROM "festivals" WHERE ("festivals"."id" = 3)

  def create
    @festival = Festival.new(params[:festival])

    respond_to do |format|
      if @festival.save
---
INSERT INTO "festivals" ("name", "created_at", "enddate", "updated_at", "startdate") VALUES('The Fringe', '2011-04-23 16:31:17', '2011-04-23 16:31:00', '2011-04-23 16:31:17', '2011-04-23 16:31:00')

  def update
    @festival = Festival.find(params[:id])

    respond_to do |format|
      if @festival.update_attributes(params[:festival])
---
SELECT * FROM "festivals" WHERE ("festivals"."id" = 3)
UPDATE "festivals" SET "startdate" = '2011-08-03 00:00:00', "updated_at" = '2011-04-23 23:00:33', "name" = 'Edinburgh Festival Fringe', "enddate" = '2011-09-03 00:00:00' WHERE "id" = 1