app/controllers/festivals_controller.rb

  def index
    @festivals = Festival.all
---
SELECT * FROM `festivals`

  def show
    @festival = Festival.find(params[:id])
---
SELECT * FROM `festivals` WHERE (`festivals`.`id` = 1)

  def create
    @festival = Festival.new(params[:festival])

    respond_to do |format|
      if @festival.save
---
INSERT INTO `festivals` (`name`, `start_date`, `created_at`, `updated_at`, `end_date`, `score`) VALUES('Edinburgh Festival Fringe', '2011-05-06 22:30:00', '2011-05-06 22:31:01', '2011-05-06 22:31:01', '2011-05-06 22:30:00', NULL)